/******************************************************
A009.C：8只数码管滚动显示数字串
display_gun():8只数码管滚动显示数字串函数
程序版本，时间
*******************************************************/


#include "config.h"
#include "intrins.h"

//共阳极数码管显示字形码0-9
uch8 segcode[]=
{0xc0,0xf9,0xa4,0xb0,0x99,0x92,0x82,0xf8,0x80,0x90,0xff};
//0    1     2   3     4   5    6    7     8    9    10

//滚动初始状态的显示字形码数组元素编号
uch8 n[]={10,10,10,10,10,10,10,10,2,5,6};

uch8 en_seg;//位选

void display_gun(void)
{
	uch8 i,j;//i表示滚动显示的状态号，j表示扫描显示的数码管号
	uch8 time_delay=30;	//前后滚动状态之间的延时参数

	for(i=0;i<11;i++)//滚动显示的11个状态显示
	{
		while(time_delay--)	//前后滚动状态之间的延时
		{
			en_seg=0x01;//8个数码管的扫描显示
			for(j=0;j<8;j++)
			{
				P2=0x00;//关位选
				P0=segcode[n[(i+j)%11]];//输出字形码
		        P2=en_seg;//开位选
				delay1ms(5);//延时
				en_seg=_crol_(en_seg,1);//获得下一次的位选码
			}
		}
		time_delay=30;
	}	
}
