/*----------------------------------------
playmusic.c:音乐播放程序文件
void playmusic(void);
IO:beep=p3^7,蜂鸣器输出端口
输入：无
输出：无
------------------------------------------*/


#include "config.h"


uint16 code f_music[]=
{ //C调 
	379,319,478,426,379,638,//3511 235.5.
	478,426,379,319,426,//1235  2222
	379,319,478,426,379,568,//3511 236.6.
	426,638,426,379,478,//25.23 1111
	284,319,284,478,//6655 6611 
	379,568,379,319,426,//36.35 2222
	379,319,478,426,379,568,//3511 236.6.
	426,638,426,379,478,//25.23 1111
	0,
};

uch8 code t_music[]=
{
	1,1,2,1,1,2,1,1,1,1,3,1,1,2,1,1,2,1,1,1,1,3,
	2,2,2,2,1,1,1,1,3,1,1,2,1,1,2,1,1,1,1,3
};

void playmusic()
{
	uch8 i;
	uint16 j;
	
	if(f_music[i]!=0)//判断T值是否为0，音乐时候停止
	{
		for(j=0;j<(40000/f_music[i]*5*t_music[i]);j++)//输出波形周期数=拍时长*拍子数/（T/2），音长
		{
			beep=~beep;//输出波形，电平翻转，幅值变化
			if(f_music>510)
			{
				delay2us(f_music[i]-510);//波形的周期延时T/2
				delay2us(255);
				delay2us(255);				
			}
			else
			{
				delay2us(f_music[i]-255);//波形的周期延时T/2
				delay2us(255);				
			}
		}
		i++;
	}

}

