/*****************************************
0/程序文件说明：byte_key.c:字节操作的键盘检测程序文件
1/函数说明：
名称功能：uch8 byte_key():字节操作的键盘检测函数
IO:P1低四位，接4个按键输入，K1K2K3K4;字节操作，无需定义
函数输入参数:无
函数输出：返回一个键值，uch8，全局变量
		  k1-14(0x0e),k2-13(0x0d),k3-11(0x0b),k4-7(0x07) 
*******************************************/

#include "config.h"

uch8 v_key;

uch8 byte_key()
{
	uch8 v0_key;	

	P1=0x0f;//0.给端口写1

	if((P1&0x0f)!=0x0f)//1、判断是否有键按下
	{
		delay1ms(15);//2、延时防抖

		if((P1&0x0f)!=0x0f)//3、再次判断有键按下
		{
			v0_key=P1&0x0f;	
//			return(v0_key);//5、返回键值
			while((P1&0x0f)!=0x0f);//4、判断按键释放			
	 		return(v0_key);//5、返回键值
		}
		else
		{
			return(0x0f);
		}
	}
	else
	{
		return(0x0f);
	}		
}
