/************************************************************************************************** 
time1.c:定时器1中断程序，10个定时器，一个中断时间为50ms
***************************************************************************************************/


#include "config.h"


//定时器开关定义
bit T00_K,T01_K,T02_K,T03_K,T04_K,T05_K,T06_K,T07_K,T08_K,T09_K;
//定时器状态定义（定时时间到为0）
bit T00_B,T01_B,T02_B,T03_B,T04_B,T05_B,T06_B,T07_B,T08_B,T09_B;
//用户使用定时器定时时间
uch8 T00,T01,T02,T03,T04,T05,T06,T07,T08,T09;


void in_1(void)interrupt 1//定时器0中断服务函数 
{ 
	EA=0;
	ET0=0;	
	TH0=0x3c;//装载初值50ms
	TL0=0xb0;
	if(T00_K==1)
	{
		T00--;
	
		if(T00==0)
		{
			T00_B=1;
			T00=delay_time[0]*20;
			T00_K=0;
		}
	}

	if(T01_K==1)
	{
		T01--;
	
		if(T01==0)
		{
			T01_B=1;
			T01=delay_time[1]*20;
			T01_K=0;
		}
	}

	if(T02_K==1)
	{
		T02--;

		if(T02==0)
		{
			T02_B=1;
			T02=delay_time[2]*20;
			T02_K=0;
		}
	}

	if(T03_K==1)
	{
		T03--;

		if(T03==0)
		{
			T03_B=1;
			T03=delay_time[3]*20;
			T03_K=0;
		}
	}

	if(T04_K==1)
	{
		T04--;
	
		if(T04==0)
		{
			T04_B=1;
			T04=delay_time[4]*20;
			T04_K=0;
		}
	}

	if(T05_K==1)
	{
		T05--;

		if(T05==0)
		{
			T05_B=1;
			T05=delay_time[5]*20;
			T05_K=0;
		}

	}

	if(T06_K==1)
	{
		T06--;

		if(T06==0)
		{
			T06_B=1;
			T06=delay_time[6]*20;
			T06_K=0;
		}
	}

	if(T07_K==1)
	{
		T07--;

		if(T07==0)
		{
			T07_B=1;
			T07=delay_time[7]*20;
			T07_K=0;
		}
	}


	EA=1;
	ET0=1;
} 
